Repository: kalehmann/f12
Catalog: po/*.po
Languages: de

source: Bios Parameter Block OEMLabel: %s Sector size: %d bytes Sectors per cluster: %d Reserved sectors: %d Number of fats: %d Root directory entries: %d Logical sectors: %d Medium byte: 0x%02x Sectors per fat: %d Sectors per track: %d Number of heads: %d Hidden sectors: %d Logical sectors (large): %d Drive number: 0x%02x Flags: 0x%02x Signature: 0x%02x VolumeID: 0x%08x Volume label: %s File system: %s
de: BIOS Parameter Block OEMLabel: %s Sektorgröße: %d bytes Sektoren per Cluster: %d Reservierte Sektoren: %d Anzahl an FATs: %d Hauptverzeichniseinträge: %d Logische Sektoren: %d Medium Byte: 0x%02x Sektoren per FAT: %d Sektoren per Track: %d Zahl der Köpfe: %d Versteckte Sektoren: %d Logische Sektoren (Voll): %d Laufwerksnummer: 0x%02x Flags: 0x%02x Signatur: 0x%02x VolumeID: 0x%08x Volumenlabel: %s Dateisystem: %s

source: Error opening image: %s
de: Fehler beim Öffnen des Abbildes: %s

source: Error while installing the default bootcode: %s
de: Fehler beim Installieren des standard Bootcodes: %s

source: Error: Can not use the boot-file option without also specifying a root directory
de: Fehler: Kann die boot-file Option nicht verwenden ohne auch ein Hauptverzeichnis anzugeben

source: Can not open the root directory %s
de: Kann das Hauptverzeichnis nicht öffnen %s

source: Expected the root dir to be a directory
de: Erwartete dass das Hauptverzeichnis ein Verzeichnis wäre

source: Error: The boot file can not be in a subdirectory
de: Fehler: Die zu bootente Datei kann nicht in einem Unterverzeichnis sein

source: Error: Could not find %s in the root directory
de: Fehler: Konnte %s nicht im Hauptverzeichnis finden

source: Error while installing the simple bootloader: %s
de: Fehler beim Installieren des Simple Bootloaders: %s

source: Error while writing the metadata to the image: %s
de: Fehler beim Schreiben der Metadaten auf das Abbild: %s

source: Error loading image: %s
de: Fehler beim Laden des Abbildes: %s

source: The file %s was not found on the device
de: Die Datei %s konnte nicht auf dem Abbild gefunden werden

source: Error while deletion: %s
de: Fehler beim Löschen: %s

source: F12 info Partition size: %s Used bytes: %s Files: %d Directories: %d
de: F12 Information Partitionsgröße: %s Belegte Bytes: %s Dateien: %d Verzeichnisse: %d

source: Allocation error: %s
de: Allokierungsfehler: %s

source: File not found
de: Datei nicht gefunden

source: Can not move the root directory
de: Kann das Hauptverzeichnis nicht verschieben

source: Can not move the directory into a child
de: Kann das Hauptverzeichnis nicht in ein Unterverzeichnis verschieben

source: File or directory %s not found
de: Datei oder Verzeichnis %s nicht gefunden

source: Error: %s
de: Fehler: %s

source: Can not open source file
de: Kann die Quelldatei nicht öffnen

source: Can not replace root directory
de: Kann das Hauptverzeichnis nicht ersetzen

source: Source file has unsupported type
de: Die Quelldatei hat einen nicht unterstützten Typ

source: An error occurred while parsing %s as a number: %s
de: Beim Versuch %s als Nummer einzulesen ist ein Fehler aufgetreten: %s

source: Could not parse %s as number
de: Konnte %s nicht als Nummer einlesen

source: Invalid value for the creation size: %ld
de: Ungültiger Wert für die creation size: %ld

source: Sector size %ld is out of range
de: Die Sector Size %ld ist ungültig

source: Sectors per cluster value %ld is out of range
de: Der Wert %ld für Sectors Per Cluster ist ungültig

source: Reserved sectors value %ld is out of range
de: Der Wert für %ld für Reserved Sectors ist ungültig

source: The number of file allocation tables %ld is invalid
de: Der Wert %ld ist für die Anzahl der File Allocation Tables ungültig

source: The number of root directory entries %ld is invalid
de: Der Wert %ld ist als Anzahl der Root Directory Entries ungültig

source: The path to the directory which contents will be put in the root directory of the created image
de: Der Pfad zu dem Verzeichnis dessen Inhalte in das Hauptverzeichnis des zu erstellenden Abbildes kopiert werden

source: The volume label of the created image (at maximum 11 characters)
de: Das Volume Label des zu erstellenden Abbildes (maximal 11 Charaktere)

source: The size of the created image in KiB (At least 10 and at maximum 32768). If no value is given, the default of 1440 is used.
de: Die Größe des zu erstellenden Abbildes in KiB (mindestens 10 und maximal 32768)

source: The sector size written into the metadata of the created image in bytes (The value must be a power of two and at least 512 and at maximum 4096). The default value depends on the size of the image.
de: Die Sektorgröße in Bytes, welche in die Metadaten des zu erstellenden Abbildes geschrieben wird (Der Wert muss eine Zweierpotenz sein und mindestens 512 betragen, aber nicht mehr als 4096). Der Standartwert hängt von der Größe des Abbildes ab.

source: The number of sectors per cluster written in the metadata of the image (The value must be a power of two and at maximum 128). The default value depends on the size of the image.
de: Die Anzahl der Sektoren per Cluster welche in die Metadaten des Abbildes geschrieben werden (Der Wert muss eine Zweipotenz sein und darf 128 nicht überschreiten). Der Standartwert hängt von der Größe des Abbildes ab.

source: The number of reserved sectors written into the metadata of the image (The value must be at least 1 and at maximum 65535). The default value is 1.
de: Die Anzahl der reservierten Sektoren welche in die Metadaten des Abbildes geschrieben werden (Der Wert muss mindestens 1 und maximal 65535 betragen). Der Standartwert ist 1.

source: The number of file allocation tables of the image. (Allowed values are 1 and 2). The default value is 2.
de: Die Zahl der File Allocation Tables auf dem Abbild. (Erlaubte Werte sind 1 und 2). Der Standartwert ist 2.

source: The number of directory entries in the root directory of the image. (Allowed values are 64, 112, 224 and 512). The default value depends on the image size.
de: Die Zahl der Einträge im Hauptverzeichnis des Abbildes. (Erlaubte Werte sind 64, 112, 224 und 512). Der Standartwert hängt von der Größe des Abbildes ab.

source: The drive number written to the metadata of the image. (Any value from 0 to 255).
de: Die Laufwerksnummer, welche in die Metadaten des zu erstellenden Abbildes geschrieben wird. (Erlaubt sind Werte von 0 bis 255).

source: Any file in the root directory that will be booted
de: Die Datei aus dem Hauptverzeichnis welche gebootet werden soll

source: Allow deletion of directories.
de: Erlaube das Löschen von Verzeichnissen.

source: Print all the parameters of the bios parameter block.
de: Zeige alle Parameter aus dem BIOS Parameter Block.

source: Print the creation date of each entry in the format YYYY-MM-DD hh:mm:ss.
de: Zeige das Erstellungsdatum von jedem Eintrag im Format YYYY-MM-DD hh:mm:ss.

source: Print the modification date of each entry in the format YYYY-MM-DD hh:mm:ss.
de: Zeige das Modifikationsdatum von jedem Eintrag im Format YYYY-MM-DD hh:mm:ss.

source: Print the access date of each entry in the format YYYY-MM-DD hh:mm:ss.
de: Zeige das Zugriffsdatum von jedem Eintrag im Format YYYY-MM-DD hh:mm:ss.

source: Show the size of each file.
de: Zeige die Größe von jeder Datei.

source: List the contents of subdirectories.
de: Liste die Inhalte von Unterverzeichnissen.

source: f12 is a tool for managing disk images of fat12 formatted drives The following options are available: vFor further information checkout the Readme at https://keller.kalehmann.de/git/f12/Reamde.md
de: f12 ist ein Tool zur Erstellung und Verwaltung von f12 formatierten Laufwerksabbildern Die folgenden Optionen sind verfügbar:vWeitere Informationen finden sich in der Readme unter https://keller.kalehmann.de/git/f12/Reamde.md

source: General options:
de: Generelle Optionen:

source: Show additional information in the output.
de: Zeige zusätzliche Informationen in der Ausgabe.

source: Error allocating memory for output
de: Fehler beim Allokieren von von Speicher für die Ausgabe

source: fts_open error: %s
de: fts_open Fehler: %s

source: fts_read error: %s
de: fts_read Fehler: %s

source: %s Cannot open source file %s
de: %s Kann die Quelldatei nicht öffnen %s

source: %s Error : %s
de: %s Fehler : %s

source: %s fts_close error: %s
de: %s fts_close Fehler: %s
